Tekla Open API Reference for Tekla Structures 2025
Model.GetProjectInfo Method
 Returns information about the current model's project.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProjectInfo GetProjectInfo()
Public Function GetProjectInfo As ProjectInfo
Return Value
Type: ProjectInfo
A ProjectInfo instance on success.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace